const note = [
    {   // 첫번째 시험
        //10
        answerType : "웹 디자인 기능사 2014년 5회",
        answerNum : "10. ",
        answerAsk : "율동(rhythm)의 요소로 볼 수 없는 것은?",
        answerChoice : [
            "점증",
            "반복",
            "변칙",
            "대칭"
        ],
        answerResult : "대칭" ,
        answerEx : "대칭은 균형의 요소입니다"
    },
    { //24
        answerType : "웹 디자인 기능사 2014년 5회",
        answerNum : "24. ",
        answerAsk : "OSI 7 계층 중 프로세스 간의 대화 제어 및 동기점을 이용한 효율적인 데이터 복구를 제공하는 계층은?",
        answerChoice : [
            "세션 계층",
            "네트워크 계층",
            "물리 계층",
            "전송 계층"
        ],
        answerResult : "세션 계층" ,
        answerEx : "네트워크 계층은 별개의 네트워크 간에 데이터 패킷을 주고 받음으로써 이러한 연결이 만들어지는 인터넷 통신 프로세스의 일부이며, 물리 계층은 컴퓨터 네트워킹의 OSI 7계층 모델에서 가장 낮은 첫 번째 계층이고, 전송 계층은 계층 구조의 네트워크 구성요소와 프로토콜 내에서 송신자와 수신자를 연결하는 통신 서비스를 제공을 뜻합니다."
    },
    { //43
        answerType : "웹 디자인 기능사 2014년 5회",
        answerNum : "43. ",
        answerAsk : "1. 마이크로소프트 사 윈도즈3.0(Windows 3.0) 발표 2. AutoDesk 사 3D 컴퓨터 애니메이션 제작 프로그램 3D Studio 발표 3. 3차원 가상현실 기술 언어인 VRML(Virtual Reality Modeling Language) 1.0 발표 를 한 역사적 시대는 언제입니까?",
        answerChoice : [
            "1960년대",
            "1970년대",
            "1980년대",
            "1990년대"
        ],
        answerResult : "1990년대" ,
        answerEx : "1990년대는 메시지 블록 데이터를 기반으로 분산 네트워크를 제안 하였고, 70,80년대에서는  다양한 프로토콜을 이용하여 개발되었습니다. 아파넷으로 말미암아 특히 인터네트워킹을 위한 프로토콜이 개발 등 인터넷을 발전시켰습니다."
    },
    { //47
        answerType : "웹 디자인 기능사 2014년 5회",
        answerNum : "47. ",
        answerAsk : "콘텐츠를 분류, 분석, 그룹핑 하는 등의 작업이 이뤄지는 정보 체계화(Contents Branch) 과정을 단계별로 가장 적절하게 나열한 것은?",
        answerChoice : [
            "콘텐츠 수집 → 콘텐츠 그룹화 → 콘텐츠 구조화 → 계층구조의 설계 → 콘텐츠 구조설계 테스트",
            "콘텐츠 수집 → 계층구조의 설계 → 콘텐츠 그룹화 → 콘텐츠 구조화 → 콘텐츠 구조설계 테스트",
            "콘텐츠 수집 → 콘텐츠 그룹화 → 콘텐츠 구조화 → 콘텐츠 구조설계 테스트 → 계층구조의 설계",
            "콘텐츠 수집 → 콘텐트 구조화 → 콘텐츠 구조설계 테스트 → 콘텐츠 그룹화 → 계층구조의 설계"
        ],
        answerResult : "콘텐츠 수집 → 콘텐츠 그룹화 → 콘텐츠 구조화 → 계층구조의 설계 → 콘텐츠 구조설계 테스트" ,
        answerEx : "콘텐츠를 수집을 하고 그룹화, 구조화를 하여야 계층 구조를 설계할 수 있기 때문에 1번이 가장 적합합니다."
    },
    { //53
        answerType : "웹 디자인 기능사 2014년 5회",
        answerNum : "53. ",
        answerAsk : "웹사이트 내에서 움직이는 배너광고를 제작하고자 할 때 사용할 프로그램으로 가장 거리가 먼 것은?",
        answerChoice : [
            "Flash",
            "Image Ready",
            "Directo",
            "Illustrator"
        ],
        answerResult : "Illustrator" ,
        answerEx : "일러스트 레이터는 벡터 이미지를 제작하는 정교한 디지털 제작 프로그램입니다."
    },

    // 두번째 시험
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "2",
        answerAsk: "면(plane)에 대한 설명으로 틀린 것은?",
        answerChoice: [
            "폭은 있으나 길이가 없다.",
            "이동하는 선의 자취가 면을 이룬다.",
            "공간을 구성하는 단위이다.",
            "넓이는 있으나 두께는 없다."
        ],
        answerResult: "폭은 있으나 길이가 없다.",
        answerEx: "면에는 길이가 있습니다."
    },
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "3",
        answerAsk: "디자인에서 사용되는 용어 설명으로 잘못된 것은?",
        answerChoice: [
            "2차원의 화면이나 형식 위에, 3차원의 공간에 존재하는 형(shape)이나 형태(form)를 표시하는 것을 투시(perspective)라 한다.",
            "장소나 위치 또는 방위가 변화되는 과정이나 움직임을 시차(parallax)라고 한다.",
            "점진적 변화, 규칙적 단계에 의해 진행되는 변화과정을 그라데이션(gradation)이라고 한다.",
            "시각적 영역 안에서 어떤 형이나 형태가 다른 형이나 형태를 부분적으로 덮어 감추어지는 현상을 중첩이라 한다."
        ],
        answerResult: "장소나 위치 또는 방위가 변화되는 과정이나 움직임을 시차(parallax)라고 한다.",
        answerEx: "시차(parallax)란 어떤 물체를 서로 다른 두 지점에서 보았을 때 생기는 방향의 차이를 말합니다."
    },
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "21",
        answerAsk: "인터넷 검색엔진에 속하지 않는 것은?",
        answerChoice: [
            "오페라(Opera)",
            "심마니(Simmani)",
            "알타비스타(Altavista)",
            "구글(Google)"
        ],
        answerResult: "오페라(Opera)",
        answerEx: "오페라(Opera)는 웹 브라우저 입니다."
    },
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "23",
        answerAsk: "다음 중 국내 인터넷 역사에서 가장 나중에 이루어진 것은?",
        answerChoice: [
            "KT(한국통신)에서 본격적인 상용 접속 서비스 제공",
            "연구망에서 인터넷 연결(HANA/SDN : 56kbps)",
            "서울대-KIET간 TCP/IP로 SDN구축",
            "교육연구망 구성(ARPANet, BITNet과 연결)"
        ],
        answerResult: "KT(한국통신)에서 본격적인 상용 접속 서비스 제공",
        answerEx: "서울대-KIET간 TCP/IP로 SDN구축(1982년),교육연구망 구성(ARPANet, BITNet과 연결)(1987년), 연구망에서 인터넷 연결(HANA/SDN : 56kbps)(1990년), KT(한국통신)에서 본격적인 상용 접속 서비스 제공(1994년)"
    },
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "34",
        answerAsk: "TCP/IP 프로토콜에 대한 설명으로 옳은 것은?",
        answerChoice: [
            "IP는 에러를 검사하여 에러가 있을 때 송신측으로 재전송을 요구한다.",
            "TCP는 통신 경로를 담당한다.",
            "TCP/IP 프로토콜이 설치된 컴퓨터에서 인터넷을 이용할 수 있다.",
            "TCP/IP는 파일전송 프로토콜로써 재전송 기능이 없다."
        ],
        answerResult: "TCP/IP 프로토콜이 설치된 컴퓨터에서 인터넷을 이용할 수 있다.",
        answerEx: "TCP/IP 프로토콜은 애플리케이션 계층, 전송 계층, 네트워크 계층, 네트워크 인터페이스 계층, 하드웨어입니다. TCP/IP 프로토콜이 설치된 컴퓨터에서 인터넷을 사용할 수 있습니다."
    },
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "37",
        answerAsk: "VRML(Virtual Reality Modeling Language)에 대한 설명으로 틀린 것은?",
        answerChoice: [
            "VRML은 그래픽 기능뿐만 아니라 텍스트, 이미지, 애니메이션, 사운드 등 각종 멀티미디어 데이터를 2차원적 공간에 통합하여 서로상호작용 할 수 있다.",
            "VRML 은 상당한 인력과 고급 컴퓨터를 이용한 오랜 시간의 그래픽 렌더링이 필요한 프로그램 언어이다.",
            "VRML은 웹 상에 가상공간을 구축할 수 있게 함으로써 원격지의 사용자와 함께 가상공간을 공유할 수 있다.",
            "VRML은 HTML과의 결합뿐만 아니라, 기존의 실시간 멀티미디어 전송 기술과 자바 등의 새로운 언어 체계도 수용 할 수 있다."
        ],
        answerResult: "VRML은 그래픽 기능뿐만 아니라 텍스트, 이미지, 애니메이션, 사운드 등 각종 멀티미디어 데이터를 2차원적 공간에 통합하여 서로상호작용 할 수 있다.",
        answerEx: "VRML은 3차원 인터렉티브 벡터 그래픽을 표현하는 표준 파일 형식으로, 월드 와이드 웹을 염두에 두고 만들어 졌습니다. 현재는 X3D로 대체되었습니다."
    },
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "39",
        answerAsk: "검색엔진의 유형 중 다른 검색엔진들과 연계하여 검색어를 찾는 방식은?",
        answerChoice: [
            "통합형 검색엔진 방식",
            "웹 인덱스 검색엔진 방식",
            "웹 디렉터리 검색엔진 방식",
            "메뉴 검색엔진 방식"
        ],
        answerResult: "통합형 검색엔진 방식",
        answerEx: "검색엔진의 유형 중 다른 검색엔진들과 연계하여 검색어를 찾는 방식은 '통합형 검색엔진 방식' 입니다."
    },
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "41",
        answerAsk: "웹 컬러 디자인의 목적과 거리가 가장 먼 것은?",
        answerChoice: [
            "정보전달의 목적",
            "레이아웃의 목적",
            "심미적인 목적",
            "상징적인 목적"
        ],
        answerResult: "레이아웃의 목적",
        answerEx: "웹 컬러 디자인의 목적으로는 정보전달, 심미적, 상징적 등이 있습니다. 레이아웃의 목적은 해당하지 않습니다."
    },
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "48",
        answerAsk: "다음 설명과 같은 파일 포맷으로 옳은 것은? → 24비트의 1600만여 가지의 색을 표현할 수 있어 연속적이고 섬세한 색 변화가 필요한 사진 이미지에 많이 쓰인다. 인터넷용은 물론 디지털 카메라와 같은 장비에도 표준적인 파일 포맷으로 주요 사용된다.",
        answerChoice: [
            "JPEG",
            "GIF",
            "PNG",
            "TIFF"
        ],
        answerResult: "JPEG",
        answerEx: "위 설명의 포맷은 JPEG이며 JPEG는 파일 크기가 작아서 빠르게 전송하고 액세스할 수 있습니다."
    },
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "50",
        answerAsk: "명령어를 일일이 입력하는 번거로움을 없애주며, 사용자들로 하여금 아이콘을 선택하여 원하는 프로그램을 실행할 수 있게 사용되는 컴퓨터 조작기법이 아닌 것은?",
        answerChoice: [
            "드래깅",
            "포인팅",
            "클릭킹",
            "더블 클릭킹"
        ],
        answerResult: "드래깅",
        answerEx: "드래깅이란 그래픽 사용자 인터페이스를 제공하는 컴퓨터의 화면상에 있는 아이콘이나 기타의 이미지 등을 움직이는 것과 관련되는 용어이며, 마우스가 움직이고 있는 동안 마우스 단추를 누르는 동작을 가리키는데 사용되기도 합니다."
    },
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "53",
        answerAsk: "동영상 관련 포맷 방식이 아닌 것은?",
        answerChoice: [
            "*.wav",
            "*.asf",
            "*.avi",
            "*.rm"
        ],
        answerResult: "*.wav",
        answerEx: "*.wav는 비압축 오디오 포맷입니다."
    },
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "57",
        answerAsk: "바람직한 웹사이트 초기화면구성이라고 볼 수 있는 것은?",
        answerChoice: [
            "자료를 테이블화 시켜서 제시하였다.",
            "JAVA applet을 많이 사용한다.",
            "웹사이트를 홍보할 수 있는 동영상을 게시한다.",
            "ActiveX를 많이 사용한다."
        ],
        answerResult: "자료를 테이블화 시켜서 제시하였다.",
        answerEx: "바람직한 웹사이트 초기화면구성이라고 볼 수 있는 것은 자료를 테이블화 시켜서 제시하는 것입니다."
    },
    {
        answerType: "웹디자인기능사 2010년 04회",
        answerNum: "58",
        answerAsk: "랜덤 스캔 방식의 화면표시 장치의 특징으로 틀린 것은?",
        answerChoice: [
            "그래픽스 명령어를 반복 실행하여 화면에 디스플레이 한다.",
            "화상을 이루고 있는 선분을 따라 전자빔을 쏘아 그린다.",
            "프레임 버퍼의 크기가 클수록 고화질의 디스플레이가 가능하다.",
            "앨리어싱이 발생하지 않으므로 안티앨리어싱 처리가 불필요하다."
        ],
        answerResult: "프레임 버퍼의 크기가 클수록 고화질의 디스플레이가 가능하다.",
        answerEx: "랜덤스캔은 화면의 임의의 점에서 임의의 점까지에 이르는 직선상으로만 전자빔을 움직이는 방식으로 시작점부터 끝점까지 선을 긋는 것이기 때문에 벡터 스캔이라고도 합니다. 하지만 프레임 버퍼는 화면에 나타날 영상 정보를 일시적으로 저장하는 기억 장치로 면 각 점의 온(on)/오프(off)나 색깔을 비트맵으로 기억하고 있습니다."
    },
    // 세번째 시험
    {
        answerType: "웹디자인기능사 2015년 2회",
        answerNum: "1",
        answerAsk: "일반적으로 환경 디자인의 종류에 해당하는 것은?",
        answerChoice: [
            "가전제품 디자인",
            "스트리트 퍼니처 디자인",
            "기업이미지 디자인",
            "캘린더 디자인"
        ],
        answerResult: "스트리트 퍼니처 디자인",
        answerEx: "환경 디자인의 종류에는 인테리어 디자인, 디스플레이 디자인, 스트리트 퍼니쳐 디자인, 무대 디자인 등이 있습니다."
    },
    {
        answerType: "웹디자인기능사 2015년 2회",
        answerNum: "4",
        answerAsk: "부분과 부분 또는 부분과 전체 사이에 안정된 관련성을 지니며 서로 함께 속해있는 것처럼 보이는 디자인 원리는?",
        answerChoice: [
            "비례",
            "조화",
            "균형",
            "강조"
        ],
        answerResult: "조화",
        answerEx: "부분과 부분 또는 부분과 전체 사이에 안정된 관련성을 지니며 서로 함께 속해있는 것처럼 보이는 디자인 원리는 조화입니다."
    },
    {
        answerType: "웹디자인기능사 2015년 2회",
        answerNum: "7",
        answerAsk: "지루함을 잊게 해 줄 수 있는 대기실이나 병원 실내의 벽에 대한 배색 계통으로 가장 적당한 것은?",
        answerChoice: [
            "난색",
            "한색",
            "중성색",
            "무채색"
        ],
        answerResult: "한색",
        answerEx: "난색은 따뜻하고 여유로운 느낌을 주고, 한색은 시원한 느낌과 긴장감을 줍니다. 지루함을 잊게 해주기 위해서는 한색이 적합합니다."
    },
    {
        answerType: "웹디자인기능사 2015년 2회",
        answerNum: "10",
        answerAsk: "'빨강 기미의 노랑'과 같이 기본 색명에다 색상, 명도, 채도를 나타내는 수식어를 붙인 색명은?",
        answerChoice: [
            "관용색명",
            "고유색명",
            "일반색명",
            "기본색명"
        ],
        answerResult: "일반색명",
        answerEx: "일반색명은 기본색명에 형용사나 수식어를 덧붙여서 색명을 표현한 것으로, 관용색명의 단점을 보완한 것입니다. '흐린 초록', '칠흑 같은 빨강' 등이 그 예시입니다."
    },
    {
        answerType: "웹디자인기능사 2015년 2회",
        answerNum: "24",
        answerAsk: "인터넷 익스플로러 6.0 에서 인터넷 옵션의 '내용관리자' 부분에 대한 설명으로 틀린 것은?",
        answerChoice: [
            "인증서 : 범주에 따른 등급을 조정할 수 있으며 그 등급에 해당하는 홈페이지로 이동할 수 있도록 추가 정보를 제공한다.",
            "승인된 사이트 : 등급 지정에 관계없이 항상 볼 수 있거나 볼 수 없는 사이트를 지정할 수 있다.",
            "일반 : 사용자 옵션과 감독자 암호를 지정할 수 있는 곳으로, 기본적으로 사용자가 제한된 내용만 보도록 표시되어 있다.",
            "고급 : 사용자가 다른 등급 시스템을 적용하려고 할 때 이용한다."
        ],
        answerResult: "인증서 : 범주에 따른 등급을 조정할 수 있으며 그 등급에 해당하는 홈페이지로 이동할 수 있도록 추가 정보를 제공한다.",
        answerEx: "인증서는 인증서 사용을 여부를 선택함으로써 웹 사이트 보안과 전자메일 보안을 설정하는 것으로, '내용관리자'가 아닌 인터넷옵션에서 바로 설정할 수 있습니다."
    },
    {
        answerType: "웹디자인기능사 2015년 2회",
        answerNum: "25",
        answerAsk: "CGI에 대한 설명으로 틀린 것은?",
        answerChoice: [
            "사용자의 프로그램 수행요구에 대한 표준 인터페이스이다.",
            "Computer Graphic Interface 의 약자이다.",
            "CGI 프로그래밍 언어로 PHP, JSP, ASP 등이 있다.",
            "클라이언트와 서버 중간에서 정보 전달을 한다."
        ],
        answerResult: "Computer Graphic Interface 의 약자이다.",
        answerEx: "CGI 의 약자는 'Common Gateway Interface'입니다."
    },
    {
        answerType: "웹디자인기능사 2015년 2회",
        answerNum: "37",
        answerAsk: "하이퍼링크를 클릭하였을 때 나타나는 문서의 위치를 지정할 수 있는 TARGET 속성의 설명으로 틀린 것은?",
        answerChoice: [
            "TARGET='_blank' : 새로운 창에 링크된 문서가 나타난다.",
            "TARGET='_self' : 현재 창에 링크된 문서가 나타난다.",
            "TARGET='_parent' : 현재 창의 부모 프레임(현재의 프레임 구조로 들어오기 이전의 한 단계 상위 페이지)에 링크된 문서가 나타난다.",
            "TARGET='_top' : 현재 여러 프레임 가운데 가장 위의 프레임에 링크된 문서가 나타난다."
        ],
        answerResult: "TARGET='_top' : 현재 여러 프레임 가운데 가장 위의 프레임에 링크된 문서가 나타난다.",
        answerEx: "Target에서 '_top' 의 속성은 현재 프레임의 최상위 프레임을 링크하는 것입니다. 문제에서는 '현재 여러 프레임'이라고 서술되어 있기 때문에 틀린 설명이 됩니다."
    },
    {
        answerType: "웹디자인기능사 2015년 2회",
        answerNum: "50",
        answerAsk: "랜덤 스캔 방식의 화면표시 장치의 특징으로 틀린 것은?",
        answerChoice: [
            "그래픽스 명령어를 반복 실행하여 화면에 디스플레이 한다.",
            "화상을 이루고 있는 선분을 따라 전자빔을 쏘아 그린다.",
            "프레임 버퍼의 크기가 클수록 고화질의 디스플레이가 가능하다.",
            "앨리어싱이 발생하지 않으므로 안티앨리어싱 처리가 불필요하다."
        ],
        answerResult: "프레임 버퍼의 크기가 클수록 고화질의 디스플레이가 가능하다.",
        answerEx: "프레임 버퍼 크기가 클수록 고화질 디스플레이가 가능한 것은 래스터 스캔 방식에 속하는 설명입니다."
    },
    {
        answerType: "웹디자인기능사 2015년 2회",
        answerNum: "55",
        answerAsk: "다음은 제 2세대의 컴퓨터 그래픽에 관한 설명이다. ( ) 안에 공통으로 들어갈 알맞은 용어는? <br>[1960년 CRT를 이용한 미국의 보잉 737 제트여객기 설계로 1965년에 ( ) 소프트웨어 개발이 활성화되었는데, 이것은 오늘날 ( )의 기반을 구축하였다.]",
        answerChoice: [
            "Computer Aided Design",
            "Computer Graphics",
            "MicroSoft",
            "Macro Media"
        ],
        answerResult: "Computer Aided Design",
        answerEx: "컴퓨터 지원 디자인 CAD(computer aided design)에 대한 설명입니다."
    },
    // 네번째 시험
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "7",
        answerAsk: "디자인 기본 요소 중 균형을 잡기 위한 요소가 아닌 것은?",
        answerChoice: [
            "명암",
            "반복",
            "크기",
            "질감"
        ],
        answerResult: "반복",
        answerEx: "반복은 율동의 한 요소이다.율동은 반복과 교차, 점이(점증), 방사, 변칙 특징이 있다."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "10",
        answerAsk: "체계적인 국가 정책을 기반으로 공학적이며, 기능적인 디자인이 특징인 국가는?",
        answerChoice: [
            "중국",
            "프랑스",
            "스칸디나비아",
            "독일"
        ],
        answerResult: "독일",
        answerEx: "체계적인 국가 정책을 기반으로 공학적이며, 기능적인 디자인이 특징인 국가는 독일입니다."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "12",
        answerAsk: "눈의 망막부위의 같은 곳에 동시적 또는 계속적으로 두 종류 이상의 색 자극이 주어져 특정한 색체감각을 일으키는 것은?",
        answerChoice: [
            "감법혼합",
            "가법혼합",
            "보색혼합",
            "중간혼합"
        ],
        answerResult: "가법혼합",
        answerEx: "눈의 망막부위의 같은 곳에 동시적 또는 계속적으로 두 종류 이상의 색 자극이 주어져 특정한 색체감각을 일으키는 것은 가법혼합입니다."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "13",
        answerAsk: "디자인(Design)의 의미를 설명한 것으로 틀린 것은?",
        answerChoice: [
            "디자인이란 프랑스어의 '데셍'에서 유래되었다.",
            "도안, 밑그림, 그림, 소묘, 계획, 설계, 목적이란 의미를 기술하고 있다.",
            "디자인은 De(이탈)와 Sign(형상)의 합성어로 기존 것을 파괴하고 새로운 재화를 창출한다는 의미가 포함된다.",
            "디자인은 기존의 것을 유지하며 실용적 가치보다는 예술적 가치의 기준을 말한다."
        ],
        answerResult: "디자인은 기존의 것을 유지하며 실용적 가치보다는 예술적 가치의 기준을 말한다.",
        answerEx: "기존의 것을 유지시키는 부분이 틀렸습니다."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "14",
        answerAsk: "다음 중 나머지 세 가지와 성격이 다른 디자인 분야는?",
        answerChoice: [
            "인테리어 디자인",
            "광고 디자인",
            "편집 디자인",
            "시각 디자인"
        ],
        answerResult: "인테리어 디자인",
        answerEx: "광고 디자인, 편집 디자인은 시각디자인에 속함.인테리어 디자인은 공업디자인에 속함."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "17",
        answerAsk: "배색의 조건 설명으로 틀린 것은?",
        answerChoice: [
            "사물의 용도나 기능에 부합되는 배색을 해야 한다.",
            "색이 주는 심리적 효과를 고려해야 한다.",
            "인간적인 요인으로 계획자의 개인적 특성에 맞추어 배색한다.",
            "환경적 요인은 충분히 고려하여 배색한다."
        ],
        answerResult: "인간적인 요인으로 계획자의 개인적 특성에 맞추어 배색한다.",
        answerEx: "배색의 조건은, 사용자의 특성에 맞추어 배색하는 것이 좋습니다."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "19",
        answerAsk: "디자인 형태의 개념에서 조화(Harmony)를 이루는 법칙과 거리가 먼 것은?",
        answerChoice: [
            "균형",
            "대비",
            "통일",
            "색상"
        ],
        answerResult: "색상",
        answerEx: "자인의 원리 - 균형, 비례, 율동, 동세, 통일, 변화, 강조, 대비, 조화"
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "21",
        answerAsk: "웹 브라우저에 해당하지 않는 것은?",
        answerChoice: [
            "인터넷 익스플로러",
            "네스케이프",
            "구글",
            "링스"
        ],
        answerResult: "구글",
        answerEx: "구글은 회사 이름이며 구글에서 개발한 웹 브라우저는 크롬입니다."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "24",
        answerAsk: "Http://alpha.hrdkorea.or.kr에 대한 설명으로 틀린 것은?",
        answerChoice: [
            "Kr은 대한민국을 나타낸다.",
            "alpha는 호스트 이름이다.",
            "or는 정부기관을 나타낸다.",
            "http는 전송 프로토콜이다."
        ],
        answerResult: "or는 정부기관을 나타낸다.",
        answerEx: "or: 비영리기관입니다"
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "29",
        answerAsk: "다음 중 세계 인터넷 역사에 가장 나중에 이루어진 것은?",
        answerChoice: [
            "ARPANet 출현",
            "Usenet 시작",
            "FTP 표준안",
            "TCP/IP 도입"
        ],
        answerResult: "TCP/IP 도입",
        answerEx: "ARPANET- 1969년, USENET - 1979년, FTP - 1972 년, TCP/IP - 1982년."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "32",
        answerAsk: "여러 개의 검색 엔진에서 정보를 찾은 다음, 중복으로 검색된 정보는 하나로 통일하고 자체 순위 결정 방식에 의해 가장 관련성이 높은 순으로 출력해 주는 것은?",
        answerChoice: [
            "주제별 검색 엔진",
            "키워드 검색 엔진",
            "메타 검색 엔진",
            "자연어 검색 엔진"
        ],
        answerResult: "메타 검색 엔진",
        answerEx: "정보는 하나로 통일하고 자체 순위 결정 방식에 의해 가장 관련성이 높은 순으로 출력해 주는 것은 메타 검색 엔진입니다."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "39",
        answerAsk: "웹 페이지 레이아웃을 구성하기 위해 사용되는 방법에 대한 설명으로 가장 거리가 먼 것은?",
        answerChoice: [
            "테이블을 이용하면 텍스트와 이미지 또는 멀티미디어 자료를 결합할 수 있는 복잡한 레이아웃을 만들 수 있다.",
            "프레임을 이용하면 브라우저 내에서 각 프레임이 독립적으로 움직일 수 있다.",
            "스타일시트는 레이아웃을 만들어내는 탁월한 방법으로 콘텐츠와 레이아웃을 분리하는 기능을 제공한다.",
            "이미지 한 장을 이용한 레이아웃은 자유롭고 다양한 효과를 줄 수 있고 내용 변경도 쉽게 할 수 있다."
        ],
        answerResult: "이미지 한 장을 이용한 레이아웃은 자유롭고 다양한 효과를 줄 수 있고 내용 변경도 쉽게 할 수 있다.",
        answerEx: "이미지 한 장을 이용한 레이아웃은 자유롭고 다양한 효과를 줄 수 있고 내용 변경도 쉽게 할 수 없습니다."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "44",
        answerAsk: "GIF 파일 포맷에 대한 설명으로 옳지 않은 것은?",
        answerChoice: [
            "24비트의 1600만여 가지의 색을 표현할 수 있다.",
            "온라인상에서 빠른 이미지의 전송을 목적으로 개발되었다.",
            "JPEG 파일에 비해 압축률이 떨어진다.",
            "GIF는 'Graphics Interchange Format'의 약자 이다."
        ],
        answerResult: "24비트의 1600만여 가지의 색을 표현할 수 있다.",
        answerEx: "GIF는 8비트의 256컬러만을 사용합니다."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "51",
        answerAsk: "애플사에서 개발한 미디어 재생기로 동영상 파일을 지원하는 것은?",
        answerChoice: [
            "Windows Media Player",
            "Real Player",
            "Shock Wave",
            "Quick Time"
        ],
        answerResult: "Quick Time",
        answerEx: "애플사에서 개발한 미디어 재생기는 Quick Time 입니다."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "52",
        answerAsk: "일반적으로 마우스의 이벤트에 반응하는 플래시 무비를 만들기 위해 등록하게 되는 심벌로 가장 적절한 것은?",
        answerChoice: [
            "그래픽 심벌",
            "버튼 심벌",
            "사운드 심벌",
            "무비 클립 심벌"
        ],
        answerResult: "버튼 심벌",
        answerEx: "마우스의 이벤트에 반응하는 플래시 무비를 만들기 위해 등록하게 되는 심벌은 버튼 심벌 입니다."
    },
    {
        answerType: "웹디자인기능사 2010년 02회",
        answerNum: "53",
        answerAsk: "웹(Web) 상에서 애니메이션 사용을 저해하는 요소가 아닌 것은?",
        answerChoice: [
            "데이터 스트리밍",
            "대역폭의 한계",
            "브라우저가 지원하지 못하는 낮은 사양의 컴퓨터",
            "인터넷의 비동기성"
        ],
        answerResult: "데이터 스트리밍",
        answerEx: "스트리밍의 가능으로 별도의 플러그인 설치없이 웹상에서 애니메이션을 재생할수 있습니다."
    },
];